{"id": 0, "question": "Given the symptoms of sudden weakness in the left arm and leg, recent long-distance travel, and the presence of swollen and tender right lower leg, what specific cardiac abnormality is most likely to be found upon further evaluation that could explain these findings?", "rubric": ["- 100 to 100: Very good", "100 to 1000: Good", "1000 to 10000: Very good", "10000 to 100000: Very good", "100000 to 1000000: Very good", "1000000 to 10000000: Very good", "10000000 to 10000000: Very good", "100000000 to 1000000"]}
{"id": 1, "question": "A 33-year-old woman is brought to the emergency department 15 minutes after being stabbed in the chest with a screwdriver. Given her vital signs of pulse 110/min, respirations 22/min, and blood pressure 90/65 mm Hg, along with the presence of a 5-cm deep stab wound at the upper border of the 8th rib in the left midaxillary line, which anatomical structure in her chest is most likely to be injured?", "rubric": ["- 100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 10"]}
{"id": 2, "question": "A 61-year-old woman with a long history of involuntary urine loss during activities like coughing or sneezing but no leakage at night undergoes a gynecological exam and Q-tip test. Based on these findings, what would cystometry most likely reveal about her residual volume and detrusor contractions?", "rubric": ["- 100 points: No answer is required.", "100 points: Yes, answer is correct.", "100 points: Yes, answer is correct.", "100 points: No, answer is incorrect.", "100 points: No, answer is incorrect.", "100 points: No, answer is incorrect.", "100 points: No, answer is incorrect.", "100 points: No, answer is incorrect.", "100 points: No, answer is incorrect.", "100 points: No, answer is incorrect.", "100 points: No, answer is incorrect."]}
{"id": 3, "question": "A 45-year-old man with a history of alcohol use, who has been abstinent for the past 10 years, presents with sudden onset dysarthria, shuffling gait, and intention tremors. Given this clinical presentation and history, what is the most likely diagnosis?", "rubric": ["- 100 to 100 is a clear and concise answer.", "100 to 100 is a clear and concise answer.", "100 to 100 is a clear and concise answer.", "100 to 100 is a clear and concise answer.", "100 to 100 is a clear and concise answer.", "100 to 100 is a clear and concise answer.", "100 to 100 is a clear and concise answer.", "100 to 100 is a clear and concise answer.", "100 to 1"]}
{"id": 4, "question": "A 45-year-old man presents with symptoms including a wide-based gait, a blank facial expression, hallucinations, memory issues, a resting tremor that resolves with movement, and bradykinesia. Based on these clinical findings, what is most likely to be observed in the histological specimen of his brain?", "rubric": ["- 1. The answer must be a single, concise sentence.", "2. The answer must contain at least 3 bullet points.", "3. The answer must be in all lowercase letters.", "4. The answer must contain at least 2 placeholders represented by square brackets, such as [address].", "5. The answer must be in all lowercase letters.", "6. The answer must contain at least 2 numbers.", "7. The answer must be in all lowercase letters.", "8. The answer must be in all lowercase letters.", "9. The answer must be in all lowercase letters.", "10. The answer must be in all"]}
{"id": 5, "question": "A patient with psoriasis was treated with systemic steroids, and upon discontinuation of the treatment, developed generalized pustules all over the body. What is the most likely cause of this condition?", "rubric": ["- 1. A statement of the topic.", "2. A statement of the question.", "3. A statement of the answer.", "4. A statement of the criteria.", "5. A statement of the conclusion.", "6. A statement of the conclusion.", "7. A statement of the conclusion.", "8. A statement of the conclusion.", "9. A statement of the conclusion.", "10. A statement of the conclusion.", "11. A statement of the conclusion.", "12. A statement of the conclusion.", "13. A statement of the conclusion.", "14."]}
{"id": 6, "question": "What is the most likely diagnosis for a 2-year-old 70 kg child who presents with limitation of abduction and internal rotation, tenderness in Scarpa's triangle, and abduction of the limb upon flexing the hip?", "rubric": ["- 100-100", "100-100", "100-100", "100-100", "100-100", "100-100", "100-100", "100-100", "100-100", "100-100", "100-100", "100-100", "100-100", "100-100", "100-100\n-"]}
{"id": 7, "question": "Scientists are developing a new non-steroidal anti-inflammatory drug for osteoarthritis, aiming for higher potency but the same efficacy as ibuprofen to reduce gastrointestinal side effects. If ibuprofen is represented by curve C in the figure and the desired therapeutic effect is marked by the dashed line Y, what curve would represent the new drug that fulfills these criteria?", "rubric": ["- 100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 10"]}
{"id": 8, "question": "A 15-year-old boy presents with decreased facial hair, bilateral breast enlargement, long extremities, scant pubic hair, small testes, and normal-sized penis. He is at the 97th percentile for height and the 50th percentile for weight. What karyotype is most likely to be found in further evaluation?", "rubric": ["- 1. The answer must be a 1-5 scale.", "2. The answer must be a 1-5 scale.", "3. The answer must be a 1-5 scale.", "4. The answer must be a 1-5 scale.", "5. The answer must be a 1-5 scale.", "6. The answer must be a 1-5 scale.", "7. The answer must be a 1-5 scale.", "8. The answer must be a 1-5 scale.", "9. The answer must be a 1-5 scale.", "10. The answer must"]}
{"id": 9, "question": "In a case where a child with pneumonia is diagnosed, and their chest X-ray indicates a pattern consistent with a common bacterial infection, what is the most likely causative organism based on typical presentations?", "rubric": ["- 1. A child with pneumonia is diagnosed.", "2. Chest X-ray shows a pattern consistent with a common bacterial infection.", "3. The child's chest X-ray is typical of a typical presentation.", "4. The child's diagnosis is supported by typical presentations.", "5. The most likely causative organism is Streptococcus pneumoniae.", "6. The most likely causative organism is Streptococcus pneumoniae.", "7. The most likely causative organism is Streptococcus pneumoniae.", "8. The most likely causative organism is Streptococcus pneumoniae.", "9. The most likely causative organism is Streptococcus pneumoniae.", "10. The most likely causative organism is Streptococcus"]}
{"id": 10, "question": "In a patient with dermatomyositis as indicated by fatigue, muscle weakness, a scaly rash, elevated creatine kinase-MB, anti-Jo-1 antibodies, and perimysial inflammation, which type of cancer is most often associated with this condition?", "rubric": ["- 100 to 100: Very good", "100 to 100: Good", "100 to 100: Fair", "100 to 100: Fair", "100 to 100: Poor", "100 to 100: Very poor\n\nAnswer:"]}
{"id": 11, "question": "Based on the presentation of gait disturbances, tremors, speech difficulties, and genetic testing revealing GAA trinucleotide repeat expansions, which chromosome is most commonly associated with the mutated gene in this condition?", "rubric": ["- 1. Please provide a concise, objective summary of the input text in up to three sentences, focusing on key actions and intentions without using second or third person pronouns.", "2. Highlight at least two sections in your answer with markdown, i.e. *highlighted section*.", "3. Use the word *genetic* at least three times.", "4. Use the word *genetic* at least three times.", "5. Use the word *genetic* at least three times.", "6. Use the word *genetic* at least three times.", "7. Use the word *genetic* at least three times.", "8."]}
{"id": 12, "question": "A 25-year-old male presents with high-grade fever and hypotension, with lab results indicating hemoglobin at 5 g/dL, total leukocyte count of 9000/mm3, and differential count of 2% polymorphs, 96% lymphocytes, and 2% eosinophils. What is a treatment option that should be avoided in this clinical scenario?", "rubric": ["- 1. High-grade fever and hypotension", "2. Laboratory results indicating hemoglobin at 5 g/dL, total leukocyte count of 9000/mm3, and differential count of 2% polymorphs, 96% lymphocytes, and 2% eosinophils", "3. High-grade fever and hypotension", "4. Laboratory results indicating hemoglobin at 5 g/dL, total leukocyte count of 9000/mm3, and differential count of 2% polymorphs, 96% lymphocytes, and 2% eosinophils", "5. High-grade fever and hypotension", "6. Laboratory results indicating hemoglobin at"]}
{"id": 13, "question": "A 45-year-old man with a history of well-controlled hypercholesterolemia, who is an avid marathon runner, presents for a routine health examination. His father's medical history includes death from a myocardial infarction at 42 years old. The patient is asymptomatic, has normal vital signs, and an unremarkable cardiopulmonary examination. An ECG is performed during his visit. Based on his profile and the provided ECG, what is the most likely type of atrioventricular (AV) block diagnosed in this patient?", "rubric": ["- 100 to 100 is a good score.", "100 to 100 is a good score.", "100 to 100 is a good score.", "100 to 100 is a good score.", "100 to 100 is a good score.", "100 to 100 is a good score.", "100 to 100 is a good score.", "100 to 100 is a good score.", "100 to 100 is a good score.", "100 to 1"]}
{"id": 14, "question": "A 42-year-old man with decreased triiodothyronine (T3) levels following recovery from pneumonia is found to have the following thyroid function test results: Thyroid-stimulating hormone (TSH) is 4.7 µU/mL, Thyroxine (T4) is 6 µg/dL, and Triiodothyronine (T3) is 68 ng/dL. Considering the clinical context, what additional hormone level is likely to be elevated in this patient?", "rubric": ["- 1. A 42-year-old man with decreased T3 levels following recovery from pneumonia is found to have the following thyroid function test results:", "2. The reverse T3 (rT3) level is 68 ng/dL.", "3. The T3 levels are 4.7 µU/mL, 6 µg/dL, and 68 ng/dL.", "4. The patient is a 42-year-old man.", "5. The patient has a normal TSH level.", "6. The patient has a normal T4 level.", "7. The patient has a normal T3 level.\n-"]}
{"id": 15, "question": "A 26-year-old man presents with lower abdominal pain that shifted from the umbilical area to the right lower abdomen. Initially managed with antibiotics, his condition worsens over two days. A CT scan reveals new hepatic abscesses. Considering these clinical details and CT findings, what is the most likely complication the patient has experienced?", "rubric": ["- 100 - 100 is a clear and concise answer.", "100 - 100 is a clear and concise answer.", "100 - 100 is a clear and concise answer.", "100 - 100 is a clear and concise answer.", "100 - 100 is a clear and concise answer.", "100 - 100 is a clear and concise answer.", "100 - 100 is a clear and concise answer.", "100 - 100 is a clear and concise answer.", "100 - 1"]}
{"id": 16, "question": "A 33-year-old woman from Peru presents with easy fatigability, shortness of breath, worsening breathlessness at night, and leg swelling. Her examination reveals distended jugular veins, basal lung crepitations, and a high-pitched apical holosystolic murmur. A transthoracic echocardiogram shows mitral regurgitation with an ejection fraction of 25%. Considering these clinical findings, what should the primary treatment focus on to alleviate her condition?", "rubric": ["- 100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 10"]}
{"id": 17, "question": "A 49-year-old man presents with heartburn and mild epigastric pain after meals for 6 months, symptoms worsening in a supine position, and a 'sour' taste in the mouth. He has tried dietary changes without relief. Laboratory tests are normal including a negative fecal occult blood test. Based on these findings and considering gastroesophageal reflux symptoms, what is the next best step in management?", "rubric": ["- 100 to 100: Excellent", "100 to 100: Good", "100 to 100: Fair", "100 to 100: Poor", "100 to 100: Very poor\n\nAnswer:"]}
{"id": 18, "question": "What is the most likely direct cause of the 11-year-old boy's symptoms of vomiting, morning worsening of symptoms, occasional headaches, and mild narrowing of visual fields, considering his intact cranial nerves and visual symptoms?", "rubric": ["- 1. No error in grammar, punctuation, spelling, or syntax", "2. No error in clarity or concision", "3. No error in grammar or punctuation, but the sentence structure is not grammatically correct", "4. No error in grammar or punctuation, but the sentence structure is not clear or concise", "5. No error in grammar or punctuation, but the sentence structure is not clear or concise", "6. No error in grammar or punctuation, but the sentence structure is not clear or concise", "7. No error in grammar or punctuation, but the sentence structure is not clear or concise", "8. No error in grammar or punctuation, but the sentence structure is not clear or"]}
{"id": 19, "question": "A 62-year-old man with a history of hypertension and type 2 diabetes, who is a smoker, is brought to the emergency department with suspected stroke. A CT scan reveals a lacunar stroke involving the left subthalamic nucleus. Based on this location of the stroke, what specific type of movement disorder is the patient most likely to exhibit upon physical examination?", "rubric": ["- 100 to 100: No movement disorder", "100 to 100: Mild hemiballismus", "100 to 100: Moderate hemiballismus", "100 to 100: Severe hemiballismus", "100 to 100: Severe hemiballismus", "100 to 100: Severe hemiballismus", "100 to 100: Severe hemiballismus", "100 to 100: Severe hemiballismus", "100 to 100:"]}
{"id": 20, "question": "What is the most appropriate management for a gravida 3 female at 22 weeks of gestation presenting with funneling of the cervix and a history of two previous second trimester abortions?", "rubric": ["- 100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 10"]}
{"id": 21, "question": "A 32-year-old man presents to the emergency department with a severe headache. He says that the pain has been getting progressively worse over the last 24 hours and is located primarily in his left forehead and eye. The headaches have woken him up from sleep and it is not relieved by over-the-counter medications. He has been recovering from a sinus infection that started 1 week ago. His past medical history is significant for type 1 diabetes and he has a 10 pack-year history of smoking. Imaging shows thrombosis of a sinus above the sella turcica. Which of the following findings would most likely also be seen in this patient?\nA. Anosmia\nB. Mandibular pain\nC. Ophthalmoplegia\nD. Vertigo\nE. Vision loss", "rubric": ["- 1. A 32-year-old man presents to the emergency department with a severe headache. He says that the pain has been getting progressively worse over the last 24 hours and is located primarily in his left forehead and eye. The headaches have woken him up from sleep and it is not relieved by over-the-counter medications. He has been recovering from a sinus infection that started 1 week ago. His past medical history is significant for type 1 diabetes and he has a 10 pack-year history of smoking.", "2. Anosmia", "3. Mandibular pain", "4. Vertigo", "5. Vision loss", "6. Ophthalmoplegia"]}
{"id": 22, "question": "A 78-year-old right-handed male has difficulty answering questions, appears frustrated with communication, and is unable to repeat phrases despite understanding them. He also has trouble writing despite intact motor control. A CT scan reveals an acute stroke in the left hemisphere. Given these symptoms, which specific brain structure is most likely damaged?", "rubric": ["- 1. Answer with a score of 0 to 100.", "2. Use a specific score range.", "3. Use a score range of -100 to 100.", "4. Use a score range of -100 to 100.", "5. Use a score range of -100 to 100.", "6. Use a score range of -100 to 100.", "7. Use a score range of -100 to 100.", "8. Use a score range of -100 to 100.", "9"]}
{"id": 23, "question": "An 8-year-old boy presents with 6 months of progressive fatigue, weight loss, decreased energy, loose stools, occasional abdominal pain and nausea, tanned skin, and bluish-black gums. Serum studies indicate hyponatremia, hyperkalemia, and hypoglycemia. Based on these symptoms and laboratory findings, what is the initial step in treatment that should be administered to this patient?", "rubric": ["- 1. A short, concise answer that is not too long.", "2. A clear, concise statement of the patient's symptoms and laboratory findings.", "3. A clear, concise statement of the initial step in treatment.", "4. A concise, descriptive statement of the initial step in treatment.", "5. A concise, descriptive statement of the initial step in treatment.", "6. A concise, descriptive statement of the initial step in treatment.", "7. A concise, descriptive statement of the initial step in treatment.", "8. A concise, descriptive statement of the initial step in treatment.", "9. A concise, descriptive statement of the initial step in treatment"]}
{"id": 24, "question": "A 7-year-old boy presents with a 2-week history of intermittent shortness of breath and a dry cough worse at night, following an upper respiratory tract infection. Spirometry is initially normal. After administration of a specific drug, repeat spirometry shows a reduced peak expiratory flow rate. Which drug is known to cause airway narrowing and is used in bronchial provocation testing in asthma diagnosis?", "rubric": ["- 1. The answer must be a single sentence.", "2. The answer must be a single sentence.", "3. The answer must be a single sentence.", "4. The answer must be a single sentence.", "5. The answer must be a single sentence.", "6. The answer must be a single sentence.", "7. The answer must be a single sentence.", "8. The answer must be a single sentence.", "9. The answer must be a single sentence.", "10. The answer must be a single sentence.", "11. The answer must be a single sentence.", "12. The answer"]}
{"id": 25, "question": "In a situation where a resident is asked by a urologist to obtain informed consent for a suprapubic catheterization procedure that the resident has not seen or performed before, what is the most appropriate action for the resident to take?", "rubric": ["- 100 - 100", "100 - 200", "200 - 300", "300 - 400", "400 - 500", "500 - 600", "600 - 700", "700 - 800", "800 - 900", "900 - 1000", "1000 - 1100", "1100 - 1200", "1200 - 1300\n-"]}
{"id": 26, "question": "Which permanent tooth is most challenging to differentiate between mesial and distal aspects based on its morphology?", "rubric": ["- 100 - 100", "100 - 100", "100 - 100", "100 - 100", "100 - 100", "100 - 100", "100 - 100", "100 - 100", "100 - 100", "100 - 100", "100 - 100", "100 - 100", "100 - 100", "100 - 10"]}
{"id": 27, "question": "Median weight of 100 children was 12 kgs. The Standard Detion was 3.Calculate the percentage coefficient of variance -\nA. 25%\nB. 35%\nC. 45%\nD. 55%", "rubric": ["- 100%: Excellent", "90%: Good", "80%: Fair", "70%: Poor", "60%: Poor", "50%: Very Poor", "40%: Very Poor", "30%: Poor", "20%: Very Poor", "10%: Very Poor\n\nAnswer:"]}
{"id": 28, "question": "A 48-year-old man presents with a 6-month history of increasing joint pain and stiffness located primarily in his knees, accompanied by redness and warmth. He has a history of diabetes, is not on medication, and experiences occasional diarrhea with fatty stools. The physical exam shows mild swelling and redness in his knees, and he has unusually tan skin despite limited sun exposure. Given these symptoms, to which disease is this patient most likely predisposed?", "rubric": ["- 1. The answer must be a 1-100 scale.", "2. The answer must be a 1-5 scale.", "3. The answer must be a 1-5 scale.", "4. The answer must be a 1-5 scale.", "5. The answer must be a 1-5 scale.", "6. The answer must be a 1-5 scale.", "7. The answer must be a 1-5 scale.", "8. The answer must be a 1-5 scale.", "9. The answer must be a 1-5 scale.", "10. The"]}
{"id": 29, "question": "A 14-year-old girl is brought to the physician because she frequently experiences cramping and pain in her legs during school sports. She is at the 10th percentile for height. Her blood pressure is 155/90 mm Hg. Examination shows a high-arched palate with maloccluded teeth and a low posterior hairline. The patient has a broad chest with widely spaced nipples. Pelvic examination shows normal external female genitalia with scant pubic hair. Without appropriate treatment, this patient is at the greatest risk of developing which of the following complications?\nA. Osteoporosis\nB. Severe acne\nC. Hyperphagia\nD. Alzheimer disease", "rubric": ["- 1. The answer must be a single word.", "2. The answer must be a single word.", "3. The answer must be a single word.", "4. The answer must be a single word.", "5. The answer must be a single word.", "6. The answer must be a single word.", "7. The answer must be a single word.", "8. The answer must be a single word.", "9. The answer must be a single word.", "10. The answer must be a single word.", "11. The answer must be a single word.", "12. The answer"]}
{"id": 30, "question": "A 45-year-old female presents with symptoms of acute cholecystitis and a 1.5 cm solitary gallstone, which are controlled with medical management. What is the next most appropriate step in her management?", "rubric": ["- 100 to 1000", "100 to 1000", "100 to 1000", "100 to 1000", "100 to 1000", "100 to 1000", "100 to 1000", "100 to 1000", "100 to 1000", "100 to 1000", "100 to 1000", "100 to 1000", "100 to 1"]}
{"id": 31, "question": "A 70 year old male patient presented to the emergency depament with pain in epigastrium and difficulty in breathing for 6 hours. On examination, his hea rate was chest examination was normal. The patient has been taking omeprazole for gastresophageal reflux disease for last 6 months. What should be the intial investigation :\nA. An ECG\nB. An upper GI endoscopy\nC. Urgent ultrasound of the abdomen\nD. An x-ray chest", "rubric": ["- 1. A 100-point score range of -100 to 100 is acceptable.", "2. The answer must be a 100-point score range of -100 to 100.", "3. The answer must be a 100-point score range of -100 to 100.", "4. The answer must be a 100-point score range of -100 to 100.", "5. The answer must be a 100-point score range of -100 to 100.", "6. The answer must be a"]}
{"id": 32, "question": "Which investigation is specifically not used for examining the small intestine among the following: Enteroclysis, Radionuclide enteroclysis, MRI enteroclysis, CT enteroclysis, USG enteroclysis?", "rubric": ["- 1. Use of a specific probe or device", "2. Use of a specific technique", "3. Use of a specific imaging modality", "4. Use of a specific imaging modality", "5. Use of a specific imaging modality", "6. Use of a specific imaging modality", "7. Use of a specific imaging modality", "8. Use of a specific imaging modality", "9. Use of a specific imaging modality", "10. Use of a specific imaging modality", "11. Use of a specific imaging modality", "12. Use of a specific imaging modality", "13. Use of a specific imaging modality", "14."]}
{"id": 33, "question": "A 46-year-old woman presents to your office with oral lesions as shown in Image A. On examination, you find that her back has flaccid bullae that spread when you apply lateral pressure with your fingertips. This patient most likely has autoantibodies directed against which of the following?\nA. Desmosomes\nB. Hemidesmosomes\nC. Lamina densa\nD. Lamina lucida\nE. Type VII collagen", "rubric": ["- 1. Please provide the answer.", "2. Please explain the answer.", "3. Please explain the reasoning behind the answer.", "4. Please explain the answer in a narrative format.", "5. Please explain the answer in a numbered format.", "6. Please explain the answer in a bold format.", "7. Please explain the answer in a bold format with a question mark.", "8. Please explain the answer in a bold format with a question mark.", "9. Please explain the answer in a bold format with a question mark.", "10. Please explain the answer in a bold format with a question mark.", "11"]}
{"id": 34, "question": "A 42-year-old woman presents complaining of pain in her hands. She reports that the pain is in both hands, and that it is usually worse in the morning. She reports that her hands are also stiff in the morning, but that this gradually improves throughout the morning. She notes, however, that her symptoms seem to be getting worse over the last three months. What is the most likely pathogenesis of her disease process?\nA. Repetitive microtrauma\nB. Production of antibodies against smooth muscle\nC. Production of antibodies against antibodies\nD. Anti-neutrophil cytoplasmic antibody production", "rubric": ["- 1. Please provide a concise, objective summary of the input text in up to three sentences, focusing on key actions and intentions without using second or third person pronouns.", "2. Highlight at least two sections in your answer with markdown, i.e. *highlighted section*.", "3. Use the word *symptom* at least three times.", "4. Avoid using the word *symptom* more than once.", "5. Finish your response with the phrase *This information was provided by the author*.", "6. Include keywords *symptom*, *symptoms*, *symptoms* in the response.", "7. Use the word *symptom* at"]}
{"id": 35, "question": "DMPA-True:a) Failure @ 0.3/100 WYb) 150 mg/3 monthly deliveredc) Weight gaind) Glucose intolerance occure) Anemia improves\nA. bcde\nB. abcd\nC. abce\nD. abde", "rubric": ["- 1. A. bcde", "2. A. bcde", "3. A. bcde", "4. A. bcde", "5. A. bcde", "6. A. bcde", "7. A. bcde", "8. A. bcde", "9. A. bcde", "10. A. bcde", "11. A. bcde", "12. A. bcde", "13. A. bcde", "14. A. bcde", "15. A. bcde", "16. A. bcde\n-"]}
{"id": 36, "question": "Calculate the APGAR score for a newborn with the following characteristics: respiratory rate of 40/min with slow and irregular respiration, heart rate of 80/min, grimace response to suctioning, completely pink skin color, and flexed posture with active limb movements.", "rubric": ["- 1-100: 1-5", "101-150: 6-10", "151-200: 7-10", "201-250: 11-15", "251-300: 16-20", "301-350: 21-25", "351-400: 28-35", "401-450: 36-40", "451-500: 48-50", "501"]}
{"id": 37, "question": "When a patient with amenorrhea experiences bleeding after a trial of progesterone, what does this indicate about the levels of estrogen, the condition of the endometrium, and the function of the pituitary axis?", "rubric": ["- 1. **No response:** No response means that the patient has not responded to the treatment.", "2. **No response:** No response means that the patient has not responded to the treatment.", "3. **No response:** No response means that the patient has not responded to the treatment.", "4. **No response:** No response means that the patient has not responded to the treatment.", "5. **No response:** No response means that the patient has not responded to the treatment.", "6. **No response:** No response means that the patient has not responded to the treatment.", "7. **No response:** No response means that the patient has not responded to the treatment"]}
{"id": 38, "question": "What substance is an addict likely using if they develop delusions, hallucinations affecting both sight and hearing, and experience the sensation of creeping things or 'grains of sand' on their skin?", "rubric": ["- 1. The answer must be a single, concise sentence.", "2. The answer must be a single, concise sentence.", "3. The answer must be a single, concise sentence.", "4. The answer must be a single, concise sentence.", "5. The answer must be a single, concise sentence.", "6. The answer must be a single, concise sentence.", "7. The answer must be a single, concise sentence.", "8. The answer must be a single, concise sentence.", "9. The answer must be a single, concise sentence.", "10. The answer must be a single, concise sentence.\n-"]}
{"id": 39, "question": "A 23-year-old woman presents to the emergency room for a self-inflicted laceration of her distal volar forearm. The patient states that she knew her husband was having sexual thoughts about the woman from the grocery store, prompting her decision to cut her own wrist. In the emergency department the bleeding is stopped and the patient is currently medically stable. When interviewing the patient, she is teary and apologizes for her behavior. She is grateful to you for her care and regrets her actions. Of note, the patient has presented to the emergency department before for a similar reason when she was struggling with online dating. The patient states that she struggles with her romantic relationship though she deeply desires them. On physical exam you note a frightened young woman who is wearing a revealing dress that prominently displays her breasts. You tell the patient that she will have to stay in the psychiatric emergency department for the night which makes her furious. Which of the following personality disorders is the most likely diagnosis?\nA. Histrionic\nB. Borderline\nC. Avoidant\nD. Dependent", "rubric": ["- 1. A 100-point score of 100 is required to evaluate the quality of the answer.", "2. The answer must be a single answer.", "3. The answer must be a single answer.", "4. The answer must be a single answer.", "5. The answer must be a single answer.", "6. The answer must be a single answer.", "7. The answer must be a single answer.", "8. The answer must be a single answer.", "9. The answer must be a single answer.", "10. The answer must be a single answer.", "11. The"]}
{"id": 40, "question": "A 50-year-old man with a long history of diabetes presents with symptoms like poor urinary stream, hesitancy, difficulty in micturition, and incomplete voiding. What condition is most likely causing these symptoms in this patient?", "rubric": ["- 100 to 100: Excellent", "100 to 100: Good", "100 to 100: Fair", "100 to 100: Poor", "100 to 100: Very Poor\n\nThe patient's age and gender are also relevant to consider. A 50-year-old man with a history of diabetes is likely a more likely candidate for the condition. However, the patient's long-standing history of diabetes introduces another significant factor that must be considered: diabetic cystopathy.\n\nIn conclusion, diabetic cystopathy is the most likely condition causing these urinary symptoms in this patient. Given the patient's"]}
{"id": 41, "question": "A 12-year-old boy presents with vomiting within 3 hours after consuming food at a party. Which organism is most likely responsible for causing these symptoms?", "rubric": ["- 1. The answer must be a single, concise sentence.", "2. The answer must be a single, concise sentence.", "3. The answer must be a single, concise sentence.", "4. The answer must be a single, concise sentence.", "5. The answer must be a single, concise sentence.", "6. The answer must be a single, concise sentence.", "7. The answer must be a single, concise sentence.", "8. The answer must be a single, concise sentence.", "9. The answer must be a single, concise sentence.", "10. The answer must be a single, concise sentence.\n-"]}
{"id": 42, "question": "A lady has history of previous child birth with neural tube defect. What is the dose of folic acid to be given to prevent to neural tube defect in this child\nA. 4000 mcg in periconceptional period\nB. 400 mg after confirmation of pregnancy\nC. 400 mg in periconceptional period\nD. 4000 mcg in 1st / 2nd trimester.", "rubric": ["- 1. The answer must be a single sentence.", "2. The answer must be a single sentence.", "3. The answer must be a single sentence.", "4. The answer must be a single sentence.", "5. The answer must be a single sentence.", "6. The answer must be a single sentence.", "7. The answer must be a single sentence.", "8. The answer must be a single sentence.", "9. The answer must be a single sentence.", "10. The answer must be a single sentence.", "11. The answer must be a single sentence.", "12. The answer"]}
{"id": 43, "question": "A 23-year-old man comes to the emergency department complaining of 10/10 abdominal pain. He describes the pain as sharp, stabbing, intermittent, and concentrated at the left lower quadrant. It started about 3 hours ago with no obvious precipitating factor. He reports multiple similar episodes in the past but they have all resolved within 1 hour or so. He denies fever, weight changes, headaches, nausea/vomiting, or gastrointestinal changes but endorses “red-colored urine” for the past day. He just returned from an extensive hiking trip in Colorado. A radiograph of the abdomen was unremarkable. What is the most likely explanation for this patient’s presentation?\nA. Dehydration leading to a build up of uric acid in the urine\nB. Hereditary defect of amino acid transporter in the kidney\nC. Infection with urease positive bacteria\nD. Presence of antibodies to the glomerular basement membrane\nE. Thinning and splitting of the glomerular basement membrane", "rubric": ["- 100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 10"]}
{"id": 44, "question": "A 36-year-old man was found to have a transient, low-volume, right-to-left shunt through the atrial septum during coughing, indicating a failure in the closure process similar to another embryologic condition. What condition, characterized by a similar embryonic development failure, involves the incomplete closure along the genital tubercle structure in males?", "rubric": ["- 100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 10"]}
{"id": 45, "question": "What is the recommended approach for initiating treatment of hypothyroidism in a patient with ischemic heart disease?", "rubric": ["- 100 points: The answer is correct, and the explanation is clear and concise.", "0 points: The answer is incorrect, and the explanation is unclear or lacks detail.", "0-50 points: The answer is unclear, and the explanation is incomplete or lacks relevant information.", "51-100 points: The answer is unclear, and the explanation is incomplete or lacks relevant information.", "101-150 points: The answer is unclear, and the explanation is incomplete or lacks relevant information.", "151-200 points: The answer is unclear, and the explanation is incomplete or lacks relevant information.", "201-2"]}
{"id": 46, "question": "A 58-year-old man with no prior cardiac history presents to the emergency department with symptoms of retrosternal chest pain starting at rest and lasting 30 minutes. The pain radiates to the left arm and is associated with diaphoresis and dyspnea.On physical examination, his blood pressure is 150/90 mm Hg, pulse is 100/min, the heart sounds are normal, and the lungs are clear to auscultation. Which of the following is the next most appropriate investigation?\nA. CT scan - chest\nB. CXR\nC. cardiac troponin\nD. ECG", "rubric": ["- 1. A 58-year-old man with no prior cardiac history presents to the emergency department with symptoms of retrosternal chest pain starting at rest and lasting 30 minutes. The pain radiates to the left arm and is associated with diaphoresis and dyspnea. On physical examination, his blood pressure is 150/90 mm Hg, pulse is 100/min, the heart sounds are normal, and the lungs are clear to auscultation.", "2. A 58-year-old man with no prior cardiac history presents to the emergency department with symptoms of retrosternal chest pain starting at rest and lasting 30 minutes. The pain radi"]}
{"id": 47, "question": "A 28-year-old woman patient who is 13 weeks pregnant presents for an antenatal clinic appointment. The patient feels embarrassed when asked to provide a urine sample and produces enough for a urine dipstick test only which is positive for leukocytes and nitrites. The patient denies any symptoms. The most appropriate treatment is:\nA. Trimethoprim\nB. Quinolone\nC. Tetracycline\nD. Cephalexin", "rubric": ["- 1. A 28-year-old woman patient who is 13 weeks pregnant presents for an antenatal clinic appointment.", "2. The patient produces enough for a urine dipstick test only which is positive for leukocytes and nitrites.", "3. The patient denies any symptoms.", "4. The most appropriate treatment is D. Cephalexin.", "5. The most appropriate treatment is D. Cephalexin.", "6. The most appropriate treatment is D. Cephalexin.", "7. The most appropriate treatment is D. Cephalexin.", "8. The most appropriate treatment is D. Cephalexin."]}
{"id": 48, "question": "What term describes an acute, aggressive type of carious process that involves multiple teeth and multiple surfaces simultaneously?", "rubric": ["- 100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 10"]}
{"id": 49, "question": "In a malaria patient, if a blood smear shows all stages of schizonts with 14-20 merozoites and a yellowish-brown pigment, what type of malaria is indicated?", "rubric": ["- 1. The answer must be a single sentence.", "2. The answer must be a single sentence.", "3. The answer must be a single sentence.", "4. The answer must be a single sentence.", "5. The answer must be a single sentence.", "6. The answer must be a single sentence.", "7. The answer must be a single sentence.", "8. The answer must be a single sentence.", "9. The answer must be a single sentence.", "10. The answer must be a single sentence.", "11. The answer must be a single sentence.", "12. The answer"]}
{"id": 50, "question": "What is the diagnosis for a child with exophytic growth with finger-like projections and hyperkeratosis on the lower lip, accompanied by a similar growth on the dorsal surface of a left thumb that is shorter than the right thumb?", "rubric": ["- 100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 10"]}
{"id": 51, "question": "In a patient with mitral stenosis and elevated liver enzymes undergoing surgery, which inhalational anesthetic agent should be preferred to minimize the risk of further liver damage?", "rubric": ["- 100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 10"]}
{"id": 52, "question": "A 50-year-old woman who was in a motor vehicle accident is experiencing numbness, tingling around her mouth, cramping of her hands, and muscle spasms after receiving multiple blood transfusions. She exhibits twitching of facial muscles upon tapping of the facial nerve. What treatment is most likely to alleviate her symptoms?", "rubric": ["- 1. The answer must be a single sentence.", "2. The answer must contain at least 2 placeholders represented by square brackets, such as [address].", "3. The answer must be in all lowercase letters.", "4. The answer must contain at least 2 numbers.", "5. The answer must be in all uppercase letters.", "6. The answer must be in all lowercase letters.", "7. The answer must be in all uppercase letters.", "8. The answer must be in all lowercase letters.", "9. The answer must be in all uppercase letters.", "10. The answer must be in all lowercase"]}
{"id": 53, "question": "What drug is known to decrease the effect of oral anticoagulants like warfarin when administered concomitantly?", "rubric": ["- 1. Runs on a scale of -100 to 100", "2. Includes a question that requires the user to provide a specific answer", "3. Includes a question that requires the user to provide a specific answer", "4. Includes a question that requires the user to provide a specific answer", "5. Includes a question that requires the user to provide a specific answer", "6. Includes a question that requires the user to provide a specific answer", "7. Includes a question that requires the user to provide a specific answer", "8. Includes a question that requires the user to provide a specific answer", "9. Includes a question that requires the user to provide"]}
{"id": 54, "question": "A 5-year-old woman presents with a two-year history of dry cough, progressive breathlessness, and examination findings of clubbing, cyanosis, and bibasilar crackles. Based on these symptoms and clinical signs, what is the most likely diagnosis?", "rubric": ["- 100-100: Mild", "100-100-100: Moderate", "100-100-100: Severe", "100-100-100: Very Severe\n\nBased on the provided information, the most likely diagnosis for the 5-year-old child is interstitial lung disease (ILD)."]}
{"id": 55, "question": "What characteristics are true about a dermoid cyst of the ovary, and how are they typically identified or diagnosed?", "rubric": ["- 100 to 1000", "Clear and concise", "No excessive elaboration", "No unnecessary words or phrases", "No blank lines or sections", "No bold or italic text", "No enumerations", "No blank lines or sections\n\nAnswer:"]}
{"id": 56, "question": "In a patient with carcinoma of the endometrium, if the inguinal lymph nodes are involved, what is the stage of the disease according to the FIGO staging system?", "rubric": ["- 1. Please provide a concise, objective summary of the input text in up to three sentences, focusing on key actions and intentions without using second or third person pronouns.", "2. Highlight at least two sections in your answer with markdown, i.e. *highlighted section*.", "3. Use the word *highlighted* at least three times in your response.", "4. Include keywords *highlighted*, *highlighted*, *highlighted*, *highlighted*, *highlighted*, *highlighted*, *highlighted*, *highlighted*, *highlighted*, *highlighted*, *highlighted*, *highlighted*, *high"]}
{"id": 57, "question": "What process is responsible for determining whether an antibody/immunoglobulin will remain membrane-bound or be secreted?", "rubric": ["- 1. The answer should be a short, concise sentence.", "2. The answer should be correct.", "3. The answer should be in the correct format.", "4. The answer should be in the correct format.", "5. The answer should be in the correct format.", "6. The answer should be in the correct format.", "7. The answer should be in the correct format.", "8. The answer should be in the correct format.", "9. The answer should be in the correct format.", "10. The answer should be in the correct format.", "11. The answer should be in the correct format"]}
{"id": 58, "question": "An asymptomatic 3-month-old infant with a history of TB exposure has already completed 3 months of chemoprophylaxis. What should be the next step in their management?", "rubric": ["- 100 points: 100% accuracy", "100 points: 99% accuracy", "100 points: 98% accuracy", "100 points: 97% accuracy", "100 points: 96% accuracy", "100 points: 95% accuracy", "100 points: 94% accuracy", "100 points: 93% accuracy", "100 points: 92% accuracy", "100 points: 91% accuracy", "100 points: 90% accuracy", "100 points:"]}
{"id": 59, "question": "In a 54-year-old female who experienced tentorial herniation and presents with her right eye directed laterally and downward, complete ptosis of the upper eyelid, and pupillary dilation, which lobe of her brain is most likely affected by the tumor as revealed in the CT scan?", "rubric": ["- 100 to 100: Very severe", "100 to 100: Severe", "100 to 100: Moderate", "100 to 100: Mild", "100 to 100: Very Severe\n\nAnswer:"]}
{"id": 60, "question": "In reviewing a CT scan of a patient with hepatocellular carcinoma, an oncologist identifies the quadrate lobe of the liver. To which hepatic duct does the quadrate lobe primarily drain bile?", "rubric": ["- 100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 10"]}
{"id": 61, "question": "A 49-year-old African American female with a history of chronic myeloid leukemia presents with oliguria and colicky left flank pain after receiving chemotherapy, indicating possible tumor lysis syndrome with elevated serum creatinine levels. What is the preferred preventative therapy that could have been administered to prevent this complication?", "rubric": ["- 1. The answer must be a single sentence.", "2. The answer must be a single sentence.", "3. The answer must be a single sentence.", "4. The answer must be a single sentence.", "5. The answer must be a single sentence.", "6. The answer must be a single sentence.", "7. The answer must be a single sentence.", "8. The answer must be a single sentence.", "9. The answer must be a single sentence.", "10. The answer must be a single sentence.", "11. The answer must be a single sentence.", "12. The answer"]}
{"id": 62, "question": "A 30-year-old female with a history of chronic cyclical abdominal pain that worsens during her menstrual cycle, and who has been married for 2 years without conceiving, presents to the clinic. What is the most appropriate next step in her management to investigate the cause of her symptoms?", "rubric": ["- 1. The answer must be a 1-100 score.", "2. The answer must be a 1-100 score.", "3. The answer must be a 1-100 score.", "4. The answer must be a 1-100 score.", "5. The answer must be a 1-100 score.", "6. The answer must be a 1-100 score.", "7. The answer must be a 1-100 score.", "8. The answer must be a 1-100 score.", "9. The answer must be"]}
{"id": 63, "question": "After a single episode of painless gross hematuria in a boy. Doctor performed an excretory urogram showing a filling defect towards the lower renal infundibulum 1.5 cm. in size. What will be the next investigation to be done -\nA. Cystoscopy\nB. Urine cytology\nC. USG\nD. Retrograde pyelography", "rubric": ["- 1. A short, concise answer", "2. No more than 100 words", "3. No more than 10 sentences", "4. No more than 5 questions", "5. No more than 10 questions in a row", "6. No more than 10 questions in a row", "7. No more than 10 questions in a row", "8. No more than 10 questions in a row", "9. No more than 10 questions in a row", "10. No more than 10 questions in a row\n\nAnswer:"]}
{"id": 64, "question": "In the context of hepatic encephalopathy, what is the relationship between liver disease severity and ammonia levels, what effect does lactulose have on the colon, what is the nature of lactulose, how effective is rifaximin at 550 mg twice daily, and what prognostic sign does hepatic encephalopathy indicate?", "rubric": ["- 100 to 100: High ammonia levels", "100 to 100: High ammonia levels", "100 to 100: High ammonia levels", "100 to 100: High ammonia levels", "100 to 100: High ammonia levels", "100 to 100: High ammonia levels", "100 to 100: High ammonia levels", "100 to 100: High ammonia levels", "100 to 100: High ammonia levels", "100 to 100: High ammonia levels\n-"]}
{"id": 65, "question": "A patient with leprosy had slightly erythematous, anesthetic plaques on the trunk and upper limbs. He was treated with paucibacillary multidrug therapy (PB-MDT) for 6 moths. At the end of 6 months, he had persistent erythema and induration in the plaque. The next step of action recommended by the World Health Organization (WHO) in such a patient is\nA. Stop antileprosy treatment\nB. Continue PB-MDT till erythema subsides\nC. Biopsy the lesion to document activity\nD. Continue Dapsone alone for another 6 months", "rubric": ["- 1. The answer must be a single sentence.", "2. The answer must contain at least 2 placeholders represented by square brackets, such as [address].", "3. The answer must contain at least 2 bullet points.", "4. The answer must contain at least 2 placeholders represented by square brackets, such as [address].", "5. The answer must contain at least 2 placeholders represented by square brackets, such as [address].", "6. The answer must contain at least 2 placeholders represented by square brackets, such as [address].", "7. The answer must contain at least 2 placeholders represented by square brackets, such as [address"]}
{"id": 66, "question": "What are the key EKG findings associated with ventricular premature beats?", "rubric": ["- 100 to 100: Very good", "100 to 1000: Good", "1000 to 10000: Very good", "10000 to 100000: Very good", "100000 to 1000000: Very good", "1000000 to 10000000: Very good", "10000000 to 10000000: Very good", "10000000 to 10000000"]}
{"id": 67, "question": "A 30-year-old woman seeks evaluation at a clinic complaining of shaking, chills, fevers, and headaches for the last 3 days. She recently returned from a trip to India, where she was visiting her family. There is no history of loss of consciousness or respiratory distress. The vital signs include temperature 38.9℃ (102.0℉), respiratory rate 19/min, blood pressure 120/80 mm Hg, and pulse 94/min (rapid and thready). On general examination, she is pale and the sclera is jaundiced. Laboratory studies show:\nHematocrit (Hct) 30%\nTotal bilirubin  2.6 mg/dL\nDirect bilirubin  0.3 mg/dL\nA peripheral smear is shown below. What is the most severe complication of this condition?\nA. Heart block\nB. Cerebral edema\nC. Aplastic crisis\nD. Rheumatoid arthritis", "rubric": ["- 1. Please provide a concise, objective summary of the input text in up to three sentences, focusing on key actions and intentions without using second or third person pronouns.", "2. Highlight at least two sections in your answer with markdown, i.e. *highlighted section*.", "3. In your answer, the word *highlighted* should appear at least 2 times.", "4. At the end of your response, please explicitly add a postscript starting with *P.S.*.", "5. Your entire response should be in English, and in all lowercase letters. no capital letters are allowed."]}
{"id": 68, "question": "A 68-year-old man presents with lower back pain radiating down his leg after traveling and helping his daughter move. His medical history includes obesity, type II diabetes, multiple concussions, and GERD. Physical exam shows pain with palpation of the lower back and leg flexion. Cardiac, pulmonary, abdominal exams are normal, and he has normal rectal tone. What is the best next step in management considering his current condition and symptoms?", "rubric": ["- 100 to 100 is acceptable", "100 to 100 is acceptable", "100 to 100 is acceptable", "100 to 100 is acceptable", "100 to 100 is acceptable", "100 to 100 is acceptable", "100 to 100 is acceptable", "100 to 100 is acceptable", "100 to 100 is acceptable", "100 to 100 is acceptable", "100 to 100 is acceptable", "100 to 10"]}
{"id": 69, "question": "Following a rugby injury, a 22-year-old man is brought to the emergency department. A fracture is observed on the X-ray. Describe whether this fracture is classified as closed or open.", "rubric": ["- 100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 10"]}
{"id": 70, "question": "A 55-year-old patient, who recently suffered a myocardial infarction and experienced mild congestive heart failure during a hospital stay, but is currently asymptomatic with a normal physical exam, presents for follow-up. What medication should be recommended to improve survival and prevent further cardiac events in this patient?", "rubric": ["- 100-100 is a clear and concise answer", "100-100 is a clear and concise answer", "100-100 is a clear and concise answer", "100-100 is a clear and concise answer", "100-100 is a clear and concise answer", "100-100 is a clear and concise answer", "100-100 is a clear and concise answer", "100-100 is a clear and concise answer", "100-100 is a clear and concise answer", "100-10"]}
{"id": 71, "question": "What mental health condition is characterized by the presence of non-bizarre delusions, such as being unfairly treated at work or having one's signature forged, without impacting one's ability to function in daily life and maintain responsibilities?", "rubric": ["- 100: Delusional disorder", "100: Delusional delusions", "100: Delusional delusions, including the presence of non-bizarre delusions", "100: Delusional delusions, including the presence of non-bizarre delusions", "100: Delusional delusions", "100: Delusional delusions, including the presence of non-bizarre delusions", "100: Delusional delusions", "100: Delusional delusions, including the presence of non-bizarre delusions", "100: Delusional delusions", "100: Delusional delusions\n-"]}
{"id": 72, "question": "What is the most probable diagnosis for a newborn presenting with profuse bleeding from the umbilical stump, given the provided clinical scenario?", "rubric": ["- 1. Answer in a single sentence.", "2. Use a single sentence to answer the question.", "3. Use a single sentence to answer the question in a way that is clear and concise.", "4. Use a single sentence to answer the question in a way that is easy to understand.", "5. Use a single sentence to answer the question in a way that is clear and concise.", "6. Use a single sentence to answer the question in a way that is easy to understand.", "7. Use a single sentence to answer the question in a way that is clear and concise.", "8. Use a single sentence to answer the question in a way that is"]}
{"id": 73, "question": "A 4-year-old boy presents with progressive leg weakness, tiredness after minimal physical activity, and large calf muscles compared to his thighs, which are symptoms suggestive of a muscular dystrophy. Considering the clinical findings and family history of autoimmune conditions, what specific diagnostic test should be performed to confirm a suspected diagnosis of Duchenne Muscular Dystrophy?", "rubric": ["- 1. The test should be performed on a 4-year-old boy.", "2. The test should be performed on a 4-year-old boy.", "3. The test should be performed on a 4-year-old boy.", "4. The test should be performed on a 4-year-old boy.", "5. The test should be performed on a 4-year-old boy.", "6. The test should be performed on a 4-year-old boy.", "7. The test should be performed on a 4-year-old boy.", "8. The test should be performed on a"]}
{"id": 74, "question": "Which microorganisms listed can grow in cell culture media?", "rubric": ["- 1. Please provide a concise, objective summary of the input text in up to three sentences.", "2. Highlight at least two sections in your answer with markdown.", "3. Use the following format:\n\n[Rubric description]\n\n[Rubric summary]\n\n[Rubric objective]\n\n[Rubric objective]\n\n[Rubric description]\n\n[Rubric summary]\n\n[Rubric objective]\n\n[Rubric description]\n\n[Rubric objective]\n\n[Rubric description]\n\n[Rubric objective]\n\n[Rubric description]\n\n[Rubric objective]\n\n[Rubric description]\n\n[Rubric objective"]}
{"id": 75, "question": "On the 6th postoperative day following a hemicolectomy, a patient develops serous discharge from the wound. What immediate management steps should be taken to address this issue?", "rubric": ["- 100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 10"]}
{"id": 76, "question": "Four days after undergoing an elective total hip replacement, a 65-year-old woman develops a DVT that embolizes to the lung. Along with tachypnea, tachycardia, and cough, the patient would most likely present with a PaO2 of what?\nA. 120 mmHg\nB. 110 mmHg\nC. 100 mmHg\nD. 85 mmHg\nE. 60 mmHg", "rubric": ["- 100 to 100 is acceptable", "100 to 100 is acceptable", "100 to 100 is acceptable", "100 to 100 is acceptable", "100 to 100 is acceptable", "100 to 100 is acceptable", "100 to 100 is acceptable", "100 to 100 is acceptable", "100 to 100 is acceptable", "100 to 100 is acceptable", "100 to 100 is acceptable", "100 to 10"]}
{"id": 77, "question": "A 22 year old male with fatigue, recurrent fever, and enlarged cervical lymph nodes has numerous atypical lymphocytes in his peripheral blood smear. A biopsy from the patient's enlarged node shows expansion of lymphoid follicles with preservation of the underlying architecture. Numerous atypical lymphocytes are present in the paracoical areas. This patient most likely has ?\nA. AIDS\nB. Burkitt's lymphoma\nC. Hodgkin's Disease\nD. Mononucleosis", "rubric": ["- 1. Please provide a detailed description of the patient's symptoms and medical history.", "2. Please describe the patient's laboratory results and any abnormalities that may be present.", "3. Please describe the patient's medical history and any potential risk factors.", "4. Please describe the patient's laboratory results and any abnormalities that may be present.", "5. Please describe the patient's medical history and any potential risk factors.", "6. Please describe the patient's laboratory results and any abnormalities that may be present.", "7. Please describe the patient's medical history and any potential risk factors.", "8. Please describe the patient's laboratory results and any abnormalities that may be present."]}
{"id": 78, "question": "A 45-year-old female undergoes renal transplantation, but shortly after the blood flow is restored to the transplanted kidney, there is inadequate perfusion due to clotting of the donor renal artery. An inflammatory reaction is observed which leads to this complication. What is the pathophysiological mechanism responsible for this issue?", "rubric": ["- 100-100", "100-100", "100-100", "100-100", "100-100", "100-100", "100-100", "100-100", "100-100", "100-100", "100-100", "100-100", "100-100", "100-100", "100-100\n-"]}
{"id": 79, "question": "A 66-year-old man with an immunocompromised status due to a lung transplant presents with progressively severe headache, vomiting, low-grade fever, and confusion for 3 days, along with a history of memory loss and headaches over the past 2 weeks. Upon examination, he has oral thrush and no focal neurological signs. A lumbar puncture is performed. Based on the clinical presentation and findings, what would you expect to find in the cerebrospinal fluid analysis in terms of its aspect, opening pressure, cell count, protein level, and glucose level?", "rubric": ["- 1. The answer must be a positive.", "2. The answer must be a positive.", "3. The answer must be a positive.", "4. The answer must be a positive.", "5. The answer must be a positive.", "6. The answer must be a positive.", "7. The answer must be a positive.", "8. The answer must be a positive.", "9. The answer must be a positive.", "10. The answer must be a positive.", "11. The answer must be a positive.", "12. The answer must be a positive.", "13."]}
{"id": 80, "question": "A patient presents with a complaint of food sticking in the interproximal area of tooth 47, which has been restored with a disto-occlusal amalgam restoration. On examination, what is the most probable reason for this problem?", "rubric": ["- 100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 10"]}
{"id": 81, "question": "In what year did the American Academy of Periodontology introduce the recent classification of periodontal disease?", "rubric": ["- 100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 10"]}
{"id": 82, "question": "A 30-year-old man comes to the physician because of recurrent episodes of right-sided jaw pain over the past 3 months. The patient describes the pain as dull. He says it worsens throughout the day and with chewing, and that it can also be felt in his right ear. He also reports hearing a cracking sound while eating. Over the past 2 months, he has had several episodes of severe headache that improves slightly with ibuprofen intake. Vital signs are within normal limits. Physical examination shows limited jaw opening. Palpation of the face shows facial muscle spasms. Which of the following is the most likely underlying cause of this patient's symptoms?\nA. Dental abscess\nB. Trigeminal nerve compression\nC. Infection of the mandible\nD. Dysfunction of the temporomandibular joint\nE. Chronic inflammation of the sinuses\n\"", "rubric": ["- 1. The answer must be a single word or a phrase.", "2. The answer must be a single word or a phrase.", "3. The answer must be a single word or a phrase.", "4. The answer must be a single word or a phrase.", "5. The answer must be a single word or a phrase.", "6. The answer must be a single word or a phrase.", "7. The answer must be a single word or a phrase.", "8. The answer must be a single word or a phrase.", "9. The answer must be a single word or a phrase.", "10. The answer must"]}
{"id": 83, "question": "A 4-year-old asthmatic child presents with an inability to speak, fast shallow breathing, pulsus paradoxus, and arterial blood gas analysis indicating respiratory acidosis. What is the next best step in the management of this patient?", "rubric": ["- 100 to 100: Excellent", "100 to 100: Good", "100 to 100: Fair", "100 to 100: Poor", "100 to 100: Very poor", "100 to 100: Very poor", "100 to 100: Very poor", "100 to 100: Poor", "100 to 100: Very poor\n\nAnswer:"]}
{"id": 84, "question": "A 18-year-old woman presents to her primary care physician reporting that she has not experienced her first menses. She is accompanied by her mother who states that she personally experienced menstruation at age 12 and that the patient's sister started menstruating at the age of 11 years. The patient is not sexually-active and denies taking any medications. On physical examination, the patient appears thin and has fine hair covering her arms. Her height is 62 inches (157.48 cm) and her weight is 85 pounds (38.5 kg). The patient does not make eye contact and only answers in one word responses. The mother is asked to step out of the room and the interview resumes. After establishing some trust, the patient admits that she does not have an appetite. She has had difficulty sleeping and some feels guilty for worrying her mother. She also admits to occasional cocaine use. She switches between binge-eating and vomiting. She is constantly fatigued but she also goes to the gym three times daily, often without her parents’ knowledge. Which of the following is the most likely diagnosis in this patient?\nA. Anorexia nervosa\nB. Bulimia nervosa\nC. Binge-eating disorder\nD. Illicit substance use\nE. Major depressive disorder", "rubric": ["- 1. The answer must be a single word response.", "2. The answer must be a single word response.", "3. The answer must be a single word response.", "4. The answer must be a single word response.", "5. The answer must be a single word response.", "6. The answer must be a single word response.", "7. The answer must be a single word response.", "8. The answer must be a single word response.", "9. The answer must be a single word response.", "10. The answer must be a single word response.", "11. The answer must be a single"]}
{"id": 85, "question": "A 33-year-old man presents with gradually worsening bilateral foot pain initially associated with long walks and now continuous with burning sensations. He has had transient painful nodules on his leg veins and a history of smoking 2 packs of cigarettes daily for 15 years. His physical examination reveals ulcers on the toes, cool feet, barely palpable pedal pulses, and a low ankle-brachial pressure index. Considering these findings, what intervention is most likely to reduce the risk of amputation in this patient?", "rubric": ["- 100 to 100: Severe symptoms and signs of the disease", "100 to 100: No symptoms or signs of the disease", "100 to 100: Mild symptoms and signs of the disease", "100 to 100: Moderate symptoms and signs of the disease", "100 to 100: Mild symptoms and signs of the disease", "100 to 100: Moderate symptoms and signs of the disease", "100 to 100: Severe symptoms and signs of the disease", "100 to 100: Severe symptoms and signs of the disease"]}
{"id": 86, "question": "A 43-year-old man with diabetes mellitus presents with rapidly progressing skin changes on his leg and signs of systemic infection after a leg injury 4 days ago. Given his vital signs indicating possible sepsis and impaired renal function, what is the most appropriate step to establish a definitive diagnosis of his condition?", "rubric": ["- 100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 10"]}
{"id": 87, "question": "When a physician classifies the condition of patients with a certain disease as 'Normal', 'Mild', 'Moderate', or 'Severe', what is the scale of measurement used for this classification?", "rubric": ["- 100 - Mild", "100 - Moderate", "50 - Severe", "20 - Very Severe", "1 - Very Mild\n\nThe scale of measurement used for this classification is an ordinal scale. This is because the classification is based on a ranking or order, rather than a numerical value. The scale is also based on the concept of \"severity\" rather than a specific numerical value."]}
{"id": 88, "question": "An 18-year-old boy presents to the eye casualty with a history of injury from a tennis ball. On examination, there is no perforation, but a hyphaema is observed. What is the most likely source of the blood causing the hyphaema in this case?", "rubric": ["- 100 to 100: The most likely source of the blood causing the hyphaema in this case is the blood vessels in the iris.", "100 to 100: The most likely source of the blood causing the hyphaema in this case is the blood vessels in the iris.", "100 to 100: The most likely source of the blood causing the hyphaema in this case is the blood vessels in the iris.", "100 to 100: The most likely source of the blood causing the hyphaema in this case is the blood vessels in the iris.", "100 to 100: The"]}
{"id": 89, "question": "A 62-year-old woman with metastatic breast cancer presents with fever, chills, and new gluteal skin lesions that evolved from painless red macules to painful ulcers within a day. These symptoms developed 2 weeks after her fourth course of palliative chemotherapy. Her laboratory results indicate neutropenia with a leukocyte count of 2,000/mm3. Considering these clinical features, identify the virulence factor most likely responsible for the pathogenesis of her skin lesions.", "rubric": ["- 1. The answer must be a short, concise statement.", "2. The answer must contain at least 2 placeholders represented by square brackets, such as [address].", "3. The answer must contain at least 2 bullet points.", "4. The answer must be in all lowercase letters.", "5. The answer must contain at least 1 sentence.", "6. The answer must be in all uppercase letters.", "7. The answer must be in all lowercase letters.", "8. The answer must be in all uppercase letters.", "9. The answer must be in all lowercase letters.", "10. The answer must be"]}
{"id": 90, "question": "A 44-year-old woman presents with facial swelling, difficulties speaking and swallowing, without any allergies or insect bites. She has a history of hypertension and type 2 diabetes mellitus and is on medication. Her physical exam shows swelling of the lips and tongue. Serum C4 levels are normal. What is the most likely underlying mechanism for this patient's symptoms?", "rubric": ["- 1. The answer must be a single sentence.", "2. The answer must be a single sentence.", "3. The answer must be a single sentence.", "4. The answer must be a single sentence.", "5. The answer must be a single sentence.", "6. The answer must be a single sentence.", "7. The answer must be a single sentence.", "8. The answer must be a single sentence.", "9. The answer must be a single sentence.", "10. The answer must be a single sentence.", "11. The answer must be a single sentence.", "12. The answer"]}
{"id": 91, "question": "A 40-year-old man who works on a farm presents with symptoms of headache, malaise, a sense of tightness, and dimness of vision. Upon examination, his pupils show a specific abnormality. Based on these symptoms and his occupational exposure, what is the most likely diagnosis?", "rubric": ["- 100 to 100 is acceptable", "100 to 100 is acceptable", "100 to 100 is acceptable", "100 to 100 is acceptable", "100 to 100 is acceptable", "100 to 100 is acceptable", "100 to 100 is acceptable", "100 to 100 is acceptable", "100 to 100 is acceptable", "100 to 100 is acceptable", "100 to 100 is acceptable", "100 to 10"]}
{"id": 92, "question": "Disinterest in food with protein/calorie malnutritionFor each of the above mention side effects, select the most likely medication to cause them.\nA. selective serotonin reuptake inhibitors (SSRIs)\nB. mineral oil\nC. diuretics\nD. INH", "rubric": ["- 1. Please provide the answer.", "2. Please explain the answer.", "3. Please explain the reasoning.", "4. Please explain the conclusion.", "5. Please explain the answer.", "6. Please explain the explanation.", "7. Please explain the explanation.", "8. Please explain the explanation.", "9. Please explain the explanation.", "10. Please explain the explanation.", "11. Please explain the explanation.", "12. Please explain the explanation.", "13. Please explain the explanation.", "14. Please explain the explanation.", "15. Please explain"]}
{"id": 93, "question": "What condition is associated with pauci-immune crescentic glomerulonephritis?", "rubric": ["- 100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 100", "100 to 10"]}
{"id": 94, "question": "A 24-year-old female is brought to the ED from a nearby nightclub by the local police due to aggressive and violent behavior over the past hour. A friend accompanying the patient reports that the patient smoked marijuana that \"seemed different\" approximately one hour ago. The patient has never had this kind of reaction to marijuana use in the past. On examination, the patient is combative with slurred speech and active visual hallucinations; eye examination shows prominent vertical nystagmus. This patient's presentation can be best explained by intoxication with a substance that acts at which of the following receptors?\nA. Serotonin\nB. Cannabinoid\nC. GABA\nD. NMDA\nE. Norepinephrine", "rubric": ["- 1. A 24-year-old female is brought to the ED from a nearby nightclub by the local police due to aggressive and violent behavior over the past hour. A friend accompanying the patient reports that the patient smoked marijuana that \"seemed different\" approximately one hour ago. The patient has never had this kind of reaction to marijuana use in the past. On examination, the patient is combative with slurred speech and active visual hallucinations; eye examination shows prominent vertical nystagmus. This patient's presentation can be best explained by intoxication with a substance that acts at NMDA receptors.", "2. A 24-year-old female is brought to the ED from a nearby nightclub by the local police"]}
{"id": 95, "question": "A 2-year-old boy presents to the emergency department with new onset seizures. After controlling the seizures with fosphenytoin loading, a history is obtained that reveals mild hypotonia and developmental delay since birth. There is also a history of a genetic biochemical disorder on the maternal side but the family does not know the name of the disease. Physical exam is unrevealing and initial lab testing shows a pH of 7.34 with a pCO2 of 31 (normal range 35-45) and a bicarbonate level of 17 mg/dl (normal range 22-28). Further bloodwork shows an accumulation of alanine and pyruvate. A deficiency in which of the following enzymes is most likely responsible for this patient's clinical syndrome?\nA. Alanine transaminase\nB. Glucose-6-phosphate dehydrogenase\nC. Glucose-6-phosphatase\nD. Pyruvate dehydrogenase\nE. Pyruvate kinase", "rubric": ["- 1. A 2-year-old boy presents to the emergency department with new onset seizures.", "2. A 2-year-old boy presents with a history of mild hypotonia and developmental delay since birth.", "3. A 2-year-old boy presents with a history of a genetic biochemical disorder on the maternal side but the family does not know the name of the disease.", "4. A 2-year-old boy presents with a history of a genetic biochemical disorder on the maternal side but the family does not know the name of the disease.", "5. A 2-year-old boy presents with a history of a genetic biochemical disorder on the maternal side but"]}
{"id": 96, "question": "The placenta secretes a hormone that is utilized in the early detection of pregnancy. This hormone is:\nA. Endothelial growth factor (EGF)\nB. Human chorionic gonadotropin (hCG)\nC. Human chorionic somatotropin (HCS)\nD. Relaxin", "rubric": ["- 1. The answer must be a single sentence.", "2. The answer must be a single sentence.", "3. The answer must be a single sentence.", "4. The answer must be a single sentence.", "5. The answer must be a single sentence.", "6. The answer must be a single sentence.", "7. The answer must be a single sentence.", "8. The answer must be a single sentence.", "9. The answer must be a single sentence.", "10. The answer must be a single sentence.", "11. The answer must be a single sentence.", "12. The answer"]}
{"id": 97, "question": "A 40-year-old woman undergoing chemotherapy for ovarian carcinoma has developed progressive bilateral sensorineural hearing loss. Which chemotherapy drug is responsible for this side effect?", "rubric": ["- 1. The answer must be a single word or phrase.", "2. The answer must be a single word or phrase.", "3. The answer must be a single word or phrase.", "4. The answer must be a single word or phrase.", "5. The answer must be a single word or phrase.", "6. The answer must be a single word or phrase.", "7. The answer must be a single word or phrase.", "8. The answer must be a single word or phrase.", "9. The answer must be a single word or phrase.", "10. The answer must be a single word or phrase.\n-"]}
{"id": 98, "question": "An 18-year-old female presents with a hypopigmented patch on both ankles. Based on standard treatment practices, identify a topical medication that is not typically used for treating this condition.", "rubric": ["- 1. A topical medication that is not typically used for treating this condition.", "2. A topical medication that is not typically used for treating hypopigmented patches caused by vitiligo.", "3. A topical medication that is not typically used for treating vitiligo.", "4. A topical medication that is not typically used for treating vitiligo.", "5. A topical medication that is not typically used for treating vitiligo.", "6. A topical medication that is not typically used for treating vitiligo.", "7. A topical medication that is not typically used for treating vitiligo.", "8. A topical medication that is not typically used for"]}
{"id": 99, "question": "A 27-year-old woman with no past medical issues and normal Pap smears every 3 years since age 21 presents with atypical squamous cells of undetermined significance (ASCUS) on her latest Pap smear. What is the next best step in her management according to current guidelines?", "rubric": ["- 100-100: Excellent", "100-100-100: Good", "100-100-100: Fair", "100-100-100: Poor", "100-100-100: Very Poor", "100-100-100: Very Poor"]}
